src/cfe/DataProcessors/кбп_МоиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>кбп_МоиЗадачи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_УведомленияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_УведомленияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/DataProcessors/кбп_МоиЗадачи/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НастроитьОформление();
	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Канал «В программе» (ФТ-609): новые уведомления всплывают, пока открыты «Мои задачи».
	ПодключитьОбработчикОжидания("ПроверитьУведомления", 60);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "кбп_ИзменениеЗадачи" Или ИмяСобытия = "кбп_ЗапускПроцесса" Тогда
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущуюЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура ПроцессыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Процессы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ТекущиеДанные.Прочитано Тогда
		ОтметитьПрочитаннымиНаСервере(ТекущиеДанные.Ид);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Задача) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Задача);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Процесс) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Процесс);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьВсе(Команда)
	ОтметитьПрочитаннымиНаСервере("");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОповещений(Команда)
	ОткрытьФорму("Обработка.кбп_МоиЗадачи.Форма.НастройкиОповещений", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу(Команда)

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроцессы Тогда
		ТекущиеДанные = Элементы.Процессы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПоказатьЗначение(, ТекущиеДанные.Ссылка);
		КонецЕсли;
	Иначе
		ОткрытьТекущуюЗадачу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроцесс(Команда)
	ОткрытьФорму("Обработка.кбп_МоиЗадачи.Форма.ЗапускПроцесса", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Всплывающие оповещения о новых уведомлениях; больше трёх — одно общее.
&НаКлиенте
Процедура ПроверитьУведомления() Экспорт

	Новые = НовыеУведомления();
	Если Новые.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Новые.Количество() > 3 Тогда
		ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Новых уведомлений: %1'"), Новые.Количество()), ,
			НСтр("ru = 'Вкладка «Уведомления» в «Моих задачах»'"), БиблиотекаКартинок.Информация);
	Иначе
		Для Каждого Уведомление Из Новые Цикл
			ПоказатьОповещениеПользователя(Уведомление.Заголовок, Уведомление.Ссылка, Уведомление.Пояснение,
				БиблиотекаКартинок.Информация);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НовыеУведомления()

	Результат = Новый Массив;
	ДанныеУведомлений = кбп_Оповещения.УведомленияПользователя(Истина);
	Для Каждого Уведомление Из ДанныеУведомлений.Новые Цикл
		Строки = СтрРазделить(Уведомление.Текст, Символы.ПС, Ложь);
		Заголовок = НСтр("ru = 'Уведомление'");
		Если Строки.Количество() > 0 Тогда
			Заголовок = Строки[0];
			Строки.Удалить(0);
		КонецЕсли;
		Источник = ?(ЗначениеЗаполнено(Уведомление.Задача), Уведомление.Задача, Уведомление.Процесс);
		Результат.Добавить(Новый Структура("Заголовок, Пояснение, Ссылка", Заголовок, Лев(СтрСоединить(Строки, " "), 200),
			?(ЗначениеЗаполнено(Источник), ПолучитьНавигационнуюСсылку(Источник), Неопределено)));
	КонецЦикла;
	Если Результат.Количество() > 0 Тогда
		ЗагрузитьУведомления();
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОтметитьПрочитаннымиНаСервере(Ид)

	Если ЗначениеЗаполнено(Ид) Тогда
		Идентификаторы = Новый Массив;
		Идентификаторы.Добавить(Ид);
		кбп_Оповещения.ОтметитьПрочитанными(Идентификаторы);
	Иначе
		кбп_Оповещения.ОтметитьПрочитанными();
	КонецЕсли;
	ЗагрузитьУведомления();

КонецПроцедуры

// Последние 100 уведомлений пользователя; непрочитанные — жирным, их число — в заголовке вкладки.
&НаСервере
Процедура ЗагрузитьУведомления()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", кбп_АдаптерКонфигурации.ТекущийПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	Уведомления.Ид КАК Ид,
	|	Уведомления.Дата КАК Дата,
	|	Уведомления.Текст КАК Текст,
	|	Уведомления.Задача КАК Задача,
	|	Уведомления.Процесс КАК Процесс,
	|	Уведомления.Прочитано КАК Прочитано
	|ИЗ
	|	РегистрСведений.кбп_УведомленияПользователей КАК Уведомления
	|ГДЕ
	|	Уведомления.Пользователь = &Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уведомления.Дата УБЫВ";
	Уведомления.Загрузить(Запрос.Выполнить().Выгрузить());
	Непрочитанных = Уведомления.НайтиСтроки(Новый Структура("Прочитано", Ложь)).Количество();
	ЗаголовокУведомлений = ?(Непрочитанных = 0, НСтр("ru = 'Уведомления'"),
		СтрШаблон(НСтр("ru = 'Уведомления (%1)'"), Непрочитанных));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущуюЗадачу()

	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	Пользователь = кбп_АдаптерКонфигурации.ТекущийПользователь();
	// Наступившие таймеры и продолжения процессов, если регламентное задание не успело.
	кбп_Движок.ЗапуститьОбработкуОчереди();

	Задачи.Очистить();
	Активных = 0;
	ЕстьЧужие = Ложь;
	Для Каждого СтрокаЗадачи Из кбп_Движок.ЗадачиПользователя(Пользователь, ПоказыватьВыполненные) Цикл
		ЗаполнитьЗначенияСвойств(Задачи.Добавить(), СтрокаЗадачи);
		Активных = Активных + ?(СтрокаЗадачи.Активна, 1, 0);
		ЕстьЧужие = ЕстьЧужие Или ЗначениеЗаполнено(СтрокаЗадачи.ЗаКого);
	КонецЦикла;
	Элементы.ЗадачиЗаКого.Видимость = ЕстьЧужие;
	ЗаголовокЗадачи = ?(Активных = 0, НСтр("ru = 'Мои задачи'"), СтрШаблон(НСтр("ru = 'Мои задачи (%1)'"), Активных));

	Процессы.Очистить();
	Для Каждого СтрокаПроцесса Из кбп_Движок.ПроцессыАвтора(Пользователь) Цикл
		ЗаполнитьЗначенияСвойств(Процессы.Добавить(), СтрокаПроцесса);
	КонецЦикла;
	ЗагрузитьУведомления();

КонецПроцедуры

// Просроченные задачи — красным, выполненные — серым.
&НаСервере
Процедура НастроитьОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задачи.Просрочена");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("Задачи");

	Элемент = УсловноеОформление.Элементы.Добавить();
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задачи.Активна");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("Задачи");

	Элемент = УсловноеОформление.Элементы.Добавить();
	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Уведомления.Прочитано");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("Уведомления");

КонецПроцедуры

#КонецОбласти
